app/controllers/books_controller.rb

	def index
		@book = Book.new
		@books = Book.all
---
SELECT "books".* FROM "books"

	def create
		@book = Book.new(book_params)
		if @book = current_user.books.new(book_params)
		   @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "12345"], ["body", "09876"], ["user_id", 11], ["created_at", "2019-12-15 10:18:43.970555"], ["updated_at", "2019-12-15 10:18:43.970555"]]

	def update
		@book = Book.find(params[:id])
		@book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "abcd"], ["body", "12345"], ["updated_at", "2019-12-15 03:47:59.000894"], ["id", 1]]