app/controllers/users_controller.rb

    def index
        @user = current_user
        @users = User.all
---
SELECT "users".* FROM "users"

    def update
        @user = User.find(params[:id])
        @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "bd47fffe23c92d0012350b1af3d85ced97ebbc8485b6e1ee5bd9bef98833"], ["introduction", "cvbnm"], ["updated_at", "2019-12-15 09:36:19.886451"], ["id", 11]]